eisup_2019_docmng_integration/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Распределять</name>
      <description>Распределять</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала проекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания проекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПроектаКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Case</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Доходный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОснованиеПроекта</name>
    <type>
      <types>CatalogRef.абс_ОснованияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрефиксКодовПроектов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТекущийЭтап</name>
    <type>
      <types>CatalogRef.абс_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДоходныйПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлановаяДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Портфель</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Комиссия</name>
    <type>
      <types>CatalogRef.КомиссияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеТребуетсяСогласованиеРПвЗЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_Заказы</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ВнутренниеЛимиты</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВиТЗ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ЭтапыПроектов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.абс_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ЭтапыПроектов/абс_ЭтапыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ЭтапыПроектов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/Проекты/Forms/ФормаНовогоЭтапа/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	НаименованиеПриИзменении(Неопределено);
	СоздатьЭтапСервер();
	Закрыть(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры

&НаСервере
Процедура СоздатьЭтапСервер()
	НовыйЭтап = ?(ЭтоГруппа, Справочники.абс_ЭтапыПроектов.СоздатьГруппу(), Справочники.абс_ЭтапыПроектов.СоздатьЭлемент());
	НовыйЭтап.Наименование = Наименование;
	НовыйЭтап.Проект = Проект;
	Если Не ЭтоГруппа Тогда 
		НовыйЭтап.ВидПроекта = Проект.абс_ВидПроекта;
	КонецЕсли;
	НовыйЭтап.Родитель = Родитель;
	НовыйЭтап.Порядок = Порядок;
	НовыйЭтап.Имя = Имя;
	НовыйЭтап.Записать();
	ЭтапПроекта = НовыйЭтап.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование()
	Наименование = СокрЛП(Порядок + " " + Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры
